{ "entries" : [ 
		{ "date" : "1/10/15", "entry" : "So far I have been having a hard time wrapping my head around getting all the posts and assignments completed for this class online. I was a little sad when they canceled the on campus section I was in and I had to join the online class because of the time conflicting with the first section on campus. I really hope I can catch on quickly to the rhythm of this class so it doesn’t seem so monotonous. I think my biggest struggle for this class will be in keeping track of what assignments are due when and learning how to work with a team over Google+. "},
		{ "date" : "1/16/15", "entry" : "This week was tough for me because of the creative nature of the assignment. I can be creative at times, but it does’t come naturally for me and so this forced me to delve into a place I’m not totally comfortable with. I think I came up with a pretty good idea for an app, something that I think would be useful to the community. I hope that I can learn enough in the subjects I will need to to make this a successful semester and come out with some new experience and knowledge." },
		{ "date" : "1/24/15", "entry" : "This has been a challenging week for me. I’ve put in about 12 hours just on one teaching Topic trying to figure out how to use the Android IDE since I couldn’t figure it out on Eclipse. I did get it up a working though so that’s good. I feel like I’ve just spent too much time on it today. I’m also struggling with GitHub and being able to upload my project to the teams SanBox code examples." },
		{ "date" : "2/14/15", "entry" : "I put a lot of time into making a video on threads this week. I learned a lot more about them than I ever have before and it made so much more sense to me once I found the right resource to explain what a Runnable was and what Threads were. The other thing I’ve been thinking about is how far behind I’m getting in my portfolios. I think I’ve got an idea of what I should do to change that however and that is to submit small snippets of code on each topic just to have something turned in and then start delving deeper into each topic to really gain an understanding of each one." },
		{ "date" : "2/21/15", "entry" : "This week I didn’t get much done in the coding topics, but I was able to add some of what I’ve done and learned about in my UML designs in my portfolio. I was also able to meet with my team in person and figure out the what and how of our project and maybe how we could introduce the 14 topics into it so that we can get “strongly agree” in our grade for the semester." },
		{ "date" : "3/6/15", "entry" : "This week I worked on building the UML diagrams that I need to submit for my topics. I also met with my group and we discussed what we wanted to each work on as our contribution to the team project. I chose to set up the activities page for our app so that students can pull in via the web and see what activities are going on around campus." },
		{ "date" : "3/14/15", "entry" : "This week I really struggled trying to figure out how to parse RSS feeds in Java because some of the easier libraries can’t be used on Android systems. I also had to spend a lot of time looking up each topic and researching what it was and how to use it so that I could write up my notes to have something turned in for the cutoff week. I’m really glad that I have the team that I do, they all seem like great guys and they’re pretty hard workers. They also have great ideas and are easy to work with. The app that we chose to build was actually Lehi’s idea and so far he’s been putting in the most man hours trying to get it up and running." },
		{ "date" : "3/21/15", "entry" : "This week I was able to come up with a parsing algorithm using the recommender XMLPuller library for Android. I was also able to finish the UML Sequence and State diagrams along with their notes. Lehi and I were able to meet up on Thursday and work on our app a little. I’m struggling finding enough material on the Application Controller Design. I’m also having a hard time finding the time to complete the rest of the Topics that I need to by the end of the semester." },
		{ "date" : "4/4/15", "entry" : "Well this week has been tough to find time to work on submitting any topics or grading material for this class. I’m really wishing that I would have understood how this class works better earlier on in the semester so that I could have gotten more accomplished earlier on. One of the big struggles that I’ve had is feeling like I have been so far behind that I’ve wondered through most of the class period if I should just quite and try it again next semester. Now that I realize what I should have been doing however I feel like this could have been a much easier course and I could have learned so much more from taking it. I honestly feel like I’ve learned some from this class, but I feel that much of it was wasted simply because of the way the course is designed. We really should have just had about 5-6 topics to learn, and learn them and other related material to them more deeply. I also think that there should have been deadlines to have specific topics turned in and evaluated on rather than a free for all. Anyways, these are some of the frustrations Ive had for this semester with this course." }
	] 
}